axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/src/n32g401f8s7_1_rcc.c
    if (RCC_Flag_Status_Get(RCC_FLAG_HSIRD) != RESET)
    {
        return SUCCESS;
    }
    else
    {
        return ERROR;
    }
}

/**
*\*\name    RCC_PLL_Config.
*\*\fun     Configures the PLL clock source and multiplication factor.
*\*\param   PLL_source(PLL entry clock source):
*\*\   		  - RCC_PLL_SRC_HSI_DIV1    HSI oscillator clock selected as PLL clock entry
*\*\   		  - RCC_PLL_SRC_HSI_DIV2    HSI oscillator clock divided by 2 selected as PLL clock entry
*\*\  	      - RCC_PLL_SRC_HSE_DIV1    HSE oscillator clock selected as PLL clock entry
*\*\ 	      - RCC_PLL_SRC_HSE_DIV2    HSE oscillator clock divided by 2 selected as PLL clock entry
*\*\param   PLL_multiplication(PLL multiplication factor):
*\*\	      - RCC_PLL_MUL_2 
*\*\	      - RCC_PLL_MUL_3  
*\*\	      - RCC_PLL_MUL_4  
*\*\	      - RCC_PLL_MUL_5  
*\*\	      - RCC_PLL_MUL_6  
*\*\	      - RCC_PLL_MUL_7  
*\*\	      - RCC_PLL_MUL_8  
*\*\	      - RCC_PLL_MUL_9  
*\*\	      - RCC_PLL_MUL_10 
*\*\	      - RCC_PLL_MUL_11 
*\*\	      - RCC_PLL_MUL_12 
*\*\	      - RCC_PLL_MUL_13 
*\*\	      - RCC_PLL_MUL_14 
*\*\	      - RCC_PLL_MUL_15
*\*\	      - RCC_PLL_MUL_16
*\*\	      - RCC_PLL_MUL_17
*\*\	      - RCC_PLL_MUL_18
*\*\	      - RCC_PLL_MUL_19
*\*\	      - RCC_PLL_MUL_20
*\*\	      - RCC_PLL_MUL_21
*\*\	      - RCC_PLL_MUL_22
*\*\	      - RCC_PLL_MUL_23
*\*\	      - RCC_PLL_MUL_24
*\*\	      - RCC_PLL_MUL_25
*\*\	      - RCC_PLL_MUL_26
*\*\	      - RCC_PLL_MUL_27
*\*\	      - RCC_PLL_MUL_28
*\*\	      - RCC_PLL_MUL_29
*\*\	      - RCC_PLL_MUL_30
*\*\	      - RCC_PLL_MUL_31
*\*\	      - RCC_PLL_MUL_32 
*\*\return  none
*\*\note    This function must be used only when the PLL is disabled.
**/
void RCC_PLL_Config(uint32_t PLL_source, uint32_t PLL_multiplication)
{
    uint32_t temp_value1,temp_value2 = 0;  
    
    temp_value1 = RCC->CFG;
    temp_value2 = RCC->PLLHSIPRE;
    /* Clear PLLSRC, PLLHSEPRES and PLLMULFCT[4:0] bits */
    temp_value1 &= RCC_PLL_MASK;
    /* Clear PLLHSIPRE bits */
    temp_value2 &= RCC_PLLHSIPRE_MASK;
    /* Set the PLL configuration bits */
    if((PLL_source == RCC_PLL_SRC_HSI_DIV1) || (PLL_source == RCC_PLL_SRC_HSI_DIV2))
    {
        temp_value1 |= PLL_multiplication;
        temp_value2 |= PLL_source;
    }
    /* (PLL_source == RCC_PLL_SRC_HSE_DIV1) || (PLL_source == RCC_PLL_SRC_HSE_DIV2) */
    else
    {
        temp_value1 |= PLL_source | PLL_multiplication;
    }
    /* Store the new value */
    RCC->CFG       = temp_value1;
    RCC->PLLHSIPRE = temp_value2;
}

/**
*\*\name    RCC_PLL_Enable.
*\*\fun     Enables the PLL.
*\*\param   none
*\*\return  none
**/ 
void RCC_PLL_Enable(void)
{
    *(__IO uint32_t*)RCC_PLLEN_BITBAND = (uint32_t)ENABLE;
}

/**
*\*\name    RCC_PLL_Disable.
*\*\fun     Disables the PLL.
*\*\param   none
*\*\return  none
**/
void RCC_PLL_Disable(void)
{
    *(__IO uint32_t*)RCC_PLLEN_BITBAND = (uint32_t)DISABLE;
}

/**
*\*\name    RCC_Sysclk_Config.
*\*\fun     Configures the system clock (SYSCLK).
*\*\param   sysclk_source(clock source used as system clock):
*\*\	     - RCC_SYSCLK_SRC_HSI       HSI selected as system clock
*\*\	     - RCC_SYSCLK_SRC_HSE       HSE selected as system clock
*\*\	     - RCC_SYSCLK_SRC_PLLCLK    PLL selected as system clock
*\*\return  none
**/
void RCC_Sysclk_Config(uint32_t sysclk_source)
{
    uint32_t temp_value = 0;
    
    temp_value = RCC->CFG;
    /* Clear SCLKSW[1:0] bits */
    temp_value &= RCC_SYSCLK_SRC_MASK;
    /* Set SCLKSW[1:0] bits according to sysclk_source value */
    temp_value |= sysclk_source;
    /* Store the new value */
    RCC->CFG = temp_value;
}

/**
*\*\name    RCC_Sysclk_Source_Get.
*\*\fun     Returns the clock source used as system clock.
*\*\param   none
*\*\return  (The clock source used as system clock):
*\*\         - 0x00    HSI used as system clock  
*\*\         - 0x04    HSE used as system clock
*\*\         - 0x08    PLL used as system clock
**/
uint8_t RCC_Sysclk_Source_Get(void)  
{  
    return ((uint8_t)(RCC->CFG & RCC_SYSCLK_STS_MASK));
}

/**
*\*\name    RCC_Hclk_Config.
*\*\fun     Configures the AHB clock (HCLK).
*\*\param   sysclk_div(AHB clock is derived from the system clock (SYSCLK)):
*\*\         - RCC_SYSCLK_DIV1      AHB clock = SYSCLK
*\*\         - RCC_SYSCLK_DIV2      AHB clock = SYSCLK/2
*\*\         - RCC_SYSCLK_DIV4      AHB clock = SYSCLK/4
*\*\         - RCC_SYSCLK_DIV8      AHB clock = SYSCLK/8
*\*\         - RCC_SYSCLK_DIV16     AHB clock = SYSCLK/16
*\*\         - RCC_SYSCLK_DIV64     AHB clock = SYSCLK/64
*\*\         - RCC_SYSCLK_DIV128    AHB clock = SYSCLK/128
*\*\         - RCC_SYSCLK_DIV256    AHB clock = SYSCLK/256
*\*\         - RCC_SYSCLK_DIV512    AHB clock = SYSCLK/512
*\*\return  none
**/
void RCC_Hclk_Config(uint32_t sysclk_div)
{
    uint32_t temp_value = 0;
    temp_value = RCC->CFG;
    /* Clear AHBPRES[3:0] bits */
    temp_value &= RCC_SYSCLK_DIV_MASK;
    /* Set AHBPRES[3:0] bits according to rcc_sysclk value */
    temp_value |= sysclk_div;
    /* Store the new value */
    RCC->CFG = temp_value;
}

/**
*\*\name    RCC_Pclk1_Config.
*\*\fun     Configures the Low Speed APB clock (PCLK1).
*\*\param   hclk_div(APB1 clock is derived from the AHB clock (HCLK)):
*\*\         - RCC_HCLK_DIV1     APB1 clock = HCLK
*\*\         - RCC_HCLK_DIV2     APB1 clock = HCLK/2
*\*\         - RCC_HCLK_DIV4     APB1 clock = HCLK/4
*\*\         - RCC_HCLK_DIV8     APB1 clock = HCLK/8
*\*\         - RCC_HCLK_DIV16    APB1 clock = HCLK/16
*\*\return  none
**/
void RCC_Pclk1_Config(uint32_t hclk_div)
{
    uint32_t temp_value = 0;
    temp_value = RCC->CFG;
    /* Clear APB1PRES[2:0] bits */
    temp_value &= RCC_APB1_DIV_MASK;
    /* Set APB1PRES[2:0] bits according to hclk_div value */
    temp_value |= hclk_div;
    /* Store the new value */
    RCC->CFG = temp_value;
}

/**
*\*\name    RCC_Pclk2_Config.
*\*\fun     Configures the High Speed APB clock (PCLK2).
*\*\param   hclk_div(APB2 clock is derived from the AHB clock (HCLK)):
*\*\         - RCC_HCLK_DIV1     APB2 clock = HCLK
*\*\         - RCC_HCLK_DIV2     APB2 clock = HCLK/2
*\*\         - RCC_HCLK_DIV4     APB2 clock = HCLK/4
*\*\         - RCC_HCLK_DIV8     APB2 clock = HCLK/8
*\*\         - RCC_HCLK_DIV16    APB2 clock = HCLK/16
*\*\return  none
**/
void RCC_Pclk2_Config(uint32_t hclk_div)
{
    uint32_t temp_value = 0;
    temp_value = RCC->CFG;
    /* Clear APB2PRES[2:0] bits */
    temp_value &= RCC_APB2_DIV_MASK;
    /* Set APB2PRES[2:0] bits according to hclk_div value */
    temp_value |= hclk_div << RCC_APB2PRES_OFFSET; 
    /* Store the new value */
    RCC->CFG = temp_value;
}

/**
*\*\name    RCC_Interrupt_Enable.
*\*\fun     Enables the specified RCC interrupts.
*\*\param   interrupt(the RCC interrupt sources to be enabled):
*\*\         - RCC_INT_LSIRDIEN    LSI ready interrupt
*\*\         - RCC_INT_HSIRDIEN    HSI ready interrupt
*\*\         - RCC_INT_HSERDIEN    HSE ready interrupt
*\*\         - RCC_INT_PLLRDIEN    PLL ready interrupt
*\*\return  none
**/
void RCC_Interrupt_Enable(uint32_t interrupt)
{
    /* Perform Byte access to RCC_CLKINT bits to enable the selected interrupts */
    RCC->CLKINT |= interrupt;
}

/**
*\*\name    RCC_Interrupt_Disable.
*\*\fun     Disables the specified RCC interrupts.
*\*\param   interrupt(the RCC interrupt sources to be disabled):
*\*\         - RCC_INT_LSIRDIEN    LSI ready interrupt
*\*\         - RCC_INT_HSIRDIEN    HSI ready interrupt
*\*\         - RCC_INT_HSERDIEN    HSE ready interrupt
*\*\         - RCC_INT_PLLRDIEN    PLL ready interrupt
*\*\return  none
**/
void RCC_Interrupt_Disable(uint32_t interrupt)
{
    /* Perform Byte access to RCC_CLKINT bits to disable the selected interrupts */
    RCC->CLKINT &= (~interrupt);
}

/**
*\*\name    RCC_TIM1_8_Clock_Config.
*\*\fun     Configures the TIM1/8 clock source(TIM1/8CLK).
*\*\param   timer1_8_clksrc(TIM1/8 clock source):
*\*\         - RCC_TIM1_8_CLKSRC_PCLK2 
*\*\         - RCC_TIM1_8_CLKSRC_SYSCLK
*\*\return  none
**/
void RCC_TIM1_8_Clock_Config(uint32_t timer1_8_clksrc)  
{
    uint32_t temp_value = 0;

    temp_value = RCC->CFG2;
    /* Clear TIMCLK_SEL bits */
    temp_value &= RCC_TIM1_8_CLKSRC_MASK;
    /* Set TIMCLK_SEL bits according to timer1_8_clksrc value */
    temp_value |= timer1_8_clksrc;

