axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/src/n32g401f8s7_1_rcc.c
    /* Store the new value */
    RCC->CFG2 = temp_value;
}

/**
*\*\name    RCC_ADC_1M_Clock_Config.
*\*\fun     Configures the ADCx 1M clock (ADC1MCLK).
*\*\param   ADC1M_clksrc(ADC1M clock source):
*\*\         - RCC_ADC1MCLK_SRC_HSI
*\*\         - RCC_ADC1MCLK_SRC_HSE
*\*\param   ADC1M_prescaler(ADC1M clock prescaler):
*\*\         - RCC_ADC1MCLK_DIV1 
*\*\         - RCC_ADC1MCLK_DIV2 
*\*\         - RCC_ADC1MCLK_DIV3 
*\*\         - RCC_ADC1MCLK_DIV4 
*\*\         - RCC_ADC1MCLK_DIV5 
*\*\         - RCC_ADC1MCLK_DIV6 
*\*\         - RCC_ADC1MCLK_DIV7 
*\*\         - RCC_ADC1MCLK_DIV8 
*\*\         - RCC_ADC1MCLK_DIV9 
*\*\         - RCC_ADC1MCLK_DIV10
*\*\         - RCC_ADC1MCLK_DIV11
*\*\         - RCC_ADC1MCLK_DIV12
*\*\         - RCC_ADC1MCLK_DIV13
*\*\         - RCC_ADC1MCLK_DIV14
*\*\         - RCC_ADC1MCLK_DIV15
*\*\         - RCC_ADC1MCLK_DIV16
*\*\         - RCC_ADC1MCLK_DIV17
*\*\         - RCC_ADC1MCLK_DIV18
*\*\         - RCC_ADC1MCLK_DIV19
*\*\         - RCC_ADC1MCLK_DIV20
*\*\         - RCC_ADC1MCLK_DIV21
*\*\         - RCC_ADC1MCLK_DIV22
*\*\         - RCC_ADC1MCLK_DIV23
*\*\         - RCC_ADC1MCLK_DIV24
*\*\         - RCC_ADC1MCLK_DIV25
*\*\         - RCC_ADC1MCLK_DIV26
*\*\         - RCC_ADC1MCLK_DIV27
*\*\         - RCC_ADC1MCLK_DIV28
*\*\         - RCC_ADC1MCLK_DIV29
*\*\         - RCC_ADC1MCLK_DIV30
*\*\         - RCC_ADC1MCLK_DIV31
*\*\         - RCC_ADC1MCLK_DIV32
*\*\return  none
**/
void RCC_ADC_1M_Clock_Config(uint32_t ADC1M_clksrc, uint32_t ADC1M_prescaler)
{
    uint32_t temp_value = 0;

    temp_value = RCC->CFG2;
    /* Clear ADC1MSEL and ADC1MPRE[4:0] bits */
    temp_value &= RCC_ADC1MCLK_SRC_MASK;
    temp_value &= RCC_ADC1MCLK_DIV_MASK;
    /* Set ADC1MSEL bits according to ADC1M_clksrc value */
    temp_value |= ADC1M_clksrc;
    /* Set ADC1MPRE[4:0] bits according to ADC1M_prescaler value */
    temp_value |= ADC1M_prescaler;

    /* Store the new value */
    RCC->CFG2 = temp_value;
}

/**
*\*\name    RCC_ADC_PLL_Clock_Prescaler_Enable.
*\*\fun     Configures the ADCPLLCLK prescaler, and enable ADCPLLCLK.
*\*\param   ADC_PLLCLK_prescaler(ADCPLLCLK prescaler):
*\*\         - RCC_ADCPLLCLK_DIV1       ADCPLLCLKPRES[4:0] = 10000, Pll Clock Divided By 1
*\*\         - RCC_ADCPLLCLK_DIV2       ADCPLLCLKPRES[4:0] = 10001, Pll Clock Divided By 2
*\*\         - RCC_ADCPLLCLK_DIV4       ADCPLLCLKPRES[4:0] = 10010, Pll Clock Divided By 4
*\*\         - RCC_ADCPLLCLK_DIV6       ADCPLLCLKPRES[4:0] = 10011, Pll Clock Divided By 6
*\*\         - RCC_ADCPLLCLK_DIV8       ADCPLLCLKPRES[4:0] = 10100, Pll Clock Divided By 8
*\*\         - RCC_ADCPLLCLK_DIV10      ADCPLLCLKPRES[4:0] = 10101, Pll Clock Divided By 10
*\*\         - RCC_ADCPLLCLK_DIV12      ADCPLLCLKPRES[4:0] = 10110, Pll Clock Divided By 12
*\*\         - RCC_ADCPLLCLK_DIV16      ADCPLLCLKPRES[4:0] = 10111, Pll Clock Divided By 16
*\*\         - RCC_ADCPLLCLK_DIV32      ADCPLLCLKPRES[4:0] = 11000, Pll Clock Divided By 32
*\*\         - RCC_ADCPLLCLK_DIV64      ADCPLLCLKPRES[4:0] = 11001, Pll Clock Divided By 64
*\*\         - RCC_ADCPLLCLK_DIV128     ADCPLLCLKPRES[4:0] = 11010, Pll Clock Divided By 128
*\*\         - RCC_ADCPLLCLK_DIV256     ADCPLLCLKPRES[4:0] = 11011, Pll Clock Divided By 256
*\*\         - RCC_ADCPLLCLK_DIV_OTHERS ADCPLLCLKPRES[4:0] = others, Pll Clock Divided By 256
*\*\return  none
**/
void RCC_ADC_PLL_Clock_Prescaler_Enable(uint32_t ADC_PLLCLK_prescaler)
{
    uint32_t temp_value = 0;

    temp_value = RCC->CFG2;
    /* Clear ADCPLLPRES[4:0] bits */
    temp_value &= RCC_ADCPLLCLK_MASK;

    temp_value |= ADC_PLLCLK_prescaler;

    /* Store the new value */
    RCC->CFG2 = temp_value;
}

/**
*\*\name    RCC_ADC_PLL_Clock_Disable.
*\*\fun     Disable ADCPLLCLK (ADCPLLCLKPRES[4:0] = 0xxxx, ADC Pll Clock Disable).
*\*\param   none
*\*\return  none
**/
void RCC_ADC_PLL_Clock_Disable(void)
{
    /* Clear ADCPLLPRES[4:0] bit4 */
    RCC->CFG2 &= RCC_ADCPLLCLK_DISABLE;
}

/**
*\*\name    RCC_ADC_Hclk_Config.
*\*\fun     Configures the ADCHCLK prescaler.
*\*\param   ADC_hclk_prescaler(ADCHCLK prescaler):
*\*\         - RCC_ADCHCLK_DIV1        ADCHCLKPRE[3:0] = 0000, HCLK Clock Divided By 1
*\*\         - RCC_ADCHCLK_DIV2        ADCHCLKPRE[3:0] = 0001, HCLK Clock Divided By 2
*\*\         - RCC_ADCHCLK_DIV4        ADCHCLKPRE[3:0] = 0010, HCLK Clock Divided By 4
*\*\         - RCC_ADCHCLK_DIV6        ADCHCLKPRE[3:0] = 0011, HCLK Clock Divided By 6
*\*\         - RCC_ADCHCLK_DIV8        ADCHCLKPRE[3:0] = 0100, HCLK Clock Divided By 8
*\*\         - RCC_ADCHCLK_DIV10       ADCHCLKPRE[3:0] = 0101, HCLK Clock Divided By 10
*\*\         - RCC_ADCHCLK_DIV12       ADCHCLKPRE[3:0] = 0110, HCLK Clock Divided By 12
*\*\         - RCC_ADCHCLK_DIV16       ADCHCLKPRE[3:0] = 0111, HCLK Clock Divided By 16
*\*\         - RCC_ADCHCLK_DIV32       ADCHCLKPRE[3:0] = 1000, HCLK Clock Divided By 32
*\*\         - RCC_ADCHCLK_DIV_OTHERS  ADCHCLKPRE[3:0] = others, HCLK Clock Divided By 32
*\*\return  none
**/
void RCC_ADC_Hclk_Config(uint32_t ADC_hclk_prescaler)
{
    uint32_t temp_value = 0;

    temp_value = RCC->CFG2;
    /* Clear ADCHPRE[3:0] bits */
    temp_value &= RCC_ADCHCLK_DIV_MASK;
    /* Set ADCHPRE[3:0] bits according to ADC_hclk_prescaler value */
    temp_value |= ADC_hclk_prescaler;

    /* Store the new value */
    RCC->CFG2 = temp_value;
}

/**
*\*\name    RCC_ADC_Hclk_Enable.
*\*\fun     Enables the ADC AHB peripheral clock.
*\*\param   none
*\*\return  none
**/
void RCC_ADC_Hclk_Enable(void)
{
    /* Store the new value */
    RCC->AHB1CLKEN |= RCC_ADCHCLK_ENABLE;
}

/**
*\*\name    RCC_ADC_Hclk_Disable.
*\*\fun     Disables the ADC AHB peripheral clock.
*\*\param   none
*\*\return  none
**/
void RCC_ADC_Hclk_Disable(void)
{
    /* Store the new value */
    RCC->AHB1CLKEN &= (~RCC_ADCHCLK_ENABLE);
}


/**
*\*\name    RCC_LSI_Enable.
*\*\fun     Enables the Internal Low Speed oscillator (LSI).
*\*\param   none
*\*\return  none
**/
void RCC_LSI_Enable(void)
{
    *(__IO uint32_t*)RCC_LSIEN_BITBAND = (uint32_t)ENABLE;
}

/**
*\*\name    RCC_LSI_Disable.
*\*\fun     Disables the Internal Low Speed oscillator (LSI).
*\*\param   none
*\*\return  none
*\*\note   LSI can not be disabled if the IWDG is running.
**/
void RCC_LSI_Disable(void)
{
    *(__IO uint32_t*)RCC_LSIEN_BITBAND = (uint32_t)DISABLE;
}

/**
*\*\name    RCC_LSI_Stable_Wait.
*\*\fun     Waits for LSI start-up.
*\*\param   none
*\*\return  ErrorStatus:
 *\*\         - SUCCESS    LSI oscillator is stable and ready to use
 *\*\         - ERROR      LSI oscillator not yet ready
**/
ErrorStatus RCC_LSI_Stable_Wait(void)
{
    __IO uint32_t counter_value = 0;
    uint32_t timeout_value = 0;   
    FlagStatus status_value     = RESET;
	RCC_ClocksType sysclk_value;

	RCC_Clocks_Frequencies_Value_Get(&sysclk_value);
	timeout_value = (HSE_STARTUP_TIMEOUT/((uint32_t)SYSCLK_FREQ_72M/sysclk_value.SysclkFreq));

    /* Wait till LSI is ready and if Time out is reached exit */
    do
    {
        status_value = RCC_Flag_Status_Get(RCC_FLAG_LSIRD);
        counter_value++;
    } while ((counter_value != timeout_value) && (status_value == RESET));
    
    if (RCC_Flag_Status_Get(RCC_FLAG_LSIRD) != RESET)
    {
        return SUCCESS;
    }
    else
    {
        return ERROR;
    }
}

/**
*\*\name    RCC_RTC_Clock_Config.
*\*\fun     Configures the RTC clock (RTCCLK).
*\*\param   rtcclk_source(the RTC clock source):
*\*\         - RCC_RTCCLK_SRC_NONE          No clock selected as RTC clock)
*\*\         - RCC_RTCCLK_SRC_LSI           LSI selected as RTC clock)
*\*\         - RCC_RTCCLK_SRC_HSE_DIV128    HSE clock divided by 128 selected as RTC clock
*\*\return  none
*\*\note    Once the RTC clock is selected it can't be changed unless the Backup domain is reset.
**/
void RCC_RTC_Clock_Config(uint32_t rtcclk_source)
{
    /* Clear the RTC clock source */
    RCC->BDCTRL &= RCC_RTCCLK_SRC_MASK;
    /* Select the RTC clock source */
    RCC->BDCTRL |= rtcclk_source;
}

/**
*\*\name    RCC_RTC_Clock_Enable.
*\*\fun     Enables the RTC clock.
*\*\param   none
*\*\return  none
*\*\note    This function must be used only after the RTC clock was selected 
*\*\        using the RCC_Config_Rtc_Clock function.
**/
void RCC_RTC_Clock_Enable(void)
{
    *(__IO uint32_t*)RCC_RTCEN_BITBAND = (uint32_t)ENABLE;
}

/**
*\*\name    RCC_RTC_Clock_Disable.
*\*\fun     Disables the RTC clock.
*\*\param   none
*\*\return  none
**/
void RCC_RTC_Clock_Disable(void)
{
    *(__IO uint32_t*)RCC_RTCEN_BITBAND = (uint32_t)DISABLE;
}

/**
*\*\name  RCC_LPTIM_Clock_Config.
*\*\fun   Configures the LPTIM clock (LPTIMCLK).
*\*\param clock_source  (specifies the LPTIM clock source).
*\*\     - RCC_LPTIMCLK_SRC_APB1  APB1 clock selected as LPTIM clock
*\*\     - RCC_LPTIMCLK_SRC_LSI   LSI selected as LPTIM clock
*\*\     - RCC_LPTIMCLK_SRC_HSI   HSI selected as LPTIM clock
*\*\note When switching from comparator1/2 to other clock sources,
*\*\      it is suggested to disable comparators first.
**/
void RCC_LPTIM_Clock_Config(uint32_t clock_source)
{
    //PWR DBP set 1
    RCC_APB1_Peripheral_Clock_Enable(RCC_APB1_PERIPH_PWR);
    PWR->CTRL |=  PWR_CTRL_DBKP;
    /* Clear the LPTIM clock source */
    RCC->RDCTRL &= RCC_LPTIMCLK_SRC_MASK;

