axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/src/n32g401f8s7_1_rcc.c
    /* Select the LPTIM clock source */
    RCC->RDCTRL |= clock_source;
}

/**
*\*\name    RCC_LPTIM_Reset.
*\*\fun     LPTIM reset.
*\*\param   none  
*\*\return  none. 
**/
void RCC_LPTIM_Reset(void)
{ 
    RCC->RDCTRL |= (RCC_LPTIMCLK_RESET);
    RCC->RDCTRL &= (~RCC_LPTIMCLK_RESET);
}

/**
*\*\name    RCC_LPTIM_Enable.
*\*\fun     Enables LPTIM.
*\*\param   none  
*\*\return  none. 
**/
void RCC_LPTIM_Enable(void)
{ 
    RCC->RDCTRL |= (RCC_LPTIMCLK_ENBLE);
}

/**
*\*\name    RCC_LPTIM_Disable.
*\*\fun     Disables LPTIM.
*\*\param   none  
*\*\return  none. 
**/
void RCC_LPTIM_Disable(void)
{ 
    RCC->RDCTRL &= (~RCC_LPTIMCLK_ENBLE);
}

/**
*\*\name    RCC_Clocks_Frequencies_Value_Get.
*\*\fun     Returns the frequencies of different on chip clocks.
*\*\param   RCC_clocks pointer to a RCC_ClocksType structure which will hold
*\*\        the clocks frequencies.
*\*\return  none
*\*\note    The result of this function could be not correct when using
*\*\        fractional value for HSE crystal.
**/
void RCC_Clocks_Frequencies_Value_Get(RCC_ClocksType* RCC_clocks)
{
    uint32_t temp_value = SYSCLK_SRC_HSI;
    uint32_t pllclk_value = 0, pllmull_value = 0,pllsource_value = 0, presc_value = 0;

    /* Get PLL clock source and multiplication factor */
    pllmull_value   = RCC->CFG & RCC_CFG_PLLMULFCT;
    pllsource_value = RCC->CFG & RCC_CFG_PLLSRC;

    /* Calculate the frequency division factor */
    if ((pllmull_value & RCC_CFG_PLLMULFCT_4) == 0)
    {
        /*  PLLMULFCT[4] = 0 */
        pllmull_value = (pllmull_value >> RCC_CFG_PLLMULFCT_OFFSET) + 2; 
    }
    else
    {
        // PLLMULFCT[4] = 1
        pllmull_value = ((pllmull_value >> RCC_CFG_PLLMULFCT_OFFSET) - 496) + 1; 
    }

    if (pllsource_value == 0) /* HSI as PLL input clock  */
    { 
         /* HSI selected as PLL clock entry */
        if ((RCC->PLLHSIPRE & RCC_PLLHSIPRE_PLLHSIPRE) != (uint32_t)RESET)
        { /* HSI oscillator clock divided by 2 */
            pllclk_value = (HSI_VALUE >> RCC_CLOCK_DIV2_OFFSET) * pllmull_value;
        }
        else
        {
            pllclk_value = HSI_VALUE * pllmull_value;
        }
    }
    else /* HSE as PLL input clock  */
    {
        /* HSE selected as PLL clock entry */
        if ((RCC->CFG & RCC_CFG_PLLHSEPRES) != (uint32_t)RESET)
        { /* HSE oscillator clock divided by 2 */
            pllclk_value = (HSE_VALUE >> RCC_CLOCK_DIV2_OFFSET) * pllmull_value;
        }
        else
        {
            pllclk_value = HSE_VALUE * pllmull_value;
        }
    }

    /* Get SYSCLK source -------------------------------------------------------*/
    temp_value = RCC->CFG & RCC_CFG_SCLKSTS;

    switch (temp_value)
    {
        case SYSCLK_SRC_HSI: 
            /* HSI used as system clock */
            RCC_clocks->SysclkFreq = HSI_VALUE;
            break;
        case SYSCLK_SRC_HSE: 
            /* HSE used as system clock */
            RCC_clocks->SysclkFreq = HSE_VALUE;
            break;
        case SYSCLK_SRC_PLL: 
            /* PLL used as system clock */
            RCC_clocks->SysclkFreq = pllclk_value;
            break;

        default:
            /* default HSI used as system clock */
            RCC_clocks->SysclkFreq = HSI_VALUE;
            break;
    }

    /* Compute HCLK, PCLK1, PCLK2 and ADCCLK clocks frequencies ----------------*/
    /* Get HCLK prescaler */
    temp_value   = (RCC->CFG & RCC_CFG_AHBPRES) >> RCC_CFG_AHBPRES_OFFSET; 
    presc_value = APBAHBPresTable[temp_value];
    /* HCLK clock frequency */
    RCC_clocks->HclkFreq = RCC_clocks->SysclkFreq >> presc_value;
    /* Get PCLK1 prescaler */
    temp_value   = (RCC->CFG & RCC_CFG_APB1PRES) >> RCC_CFG_APB1PRES_OFFSET; 
    presc_value = APBAHBPresTable[temp_value];
    /* PCLK1 clock frequency */
    RCC_clocks->Pclk1Freq = RCC_clocks->HclkFreq >> presc_value;
    /* Get PCLK2 prescaler */
    temp_value   = (RCC->CFG & RCC_CFG_APB2PRES) >> RCC_CFG_APB2PRES_OFFSET; 
    presc_value = APBAHBPresTable[temp_value];
    /* PCLK2 clock frequency */
    RCC_clocks->Pclk2Freq = RCC_clocks->HclkFreq >> presc_value;

    /* Get ADCHCLK prescaler */
    temp_value   = RCC->CFG2 & RCC_CFG2_ADCHPRES;
    presc_value = ADCHCLKPresTable[temp_value];
    /* ADCHCLK clock frequency */
    RCC_clocks->AdcHclkFreq = RCC_clocks->HclkFreq / presc_value;
    /* Get ADCPLLCLK prescaler */
    temp_value   = (RCC->CFG2 & RCC_CFG2_ADCPLLPRES) >> RCC_CFG2_ADCPLLPRES_OFFSET; 
    presc_value = ADCPLLCLKPresTable[(temp_value & 0x0F)]; // ignore BIT5
    /* ADCPLLCLK clock frequency */
    RCC_clocks->AdcPllClkFreq = pllclk_value / presc_value;
}

/**
*\*\name    RCC_AHB_Peripheral_Clock_Enable.
*\*\fun     Enables the AHB peripheral clock.
*\*\param   AHB_periph (AHB peripheral to gates its clock):
*\*\         - RCC_AHB_PERIPH_DMA    
*\*\         - RCC_AHB_PERIPH_SRAM   
*\*\         - RCC_AHB_PERIPH_FLITF  
*\*\         - RCC_AHB_PERIPH_CRC    
*\*\         - RCC_AHB_PERIPH_GPIOA   
*\*\         - RCC_AHB_PERIPH_GPIOB  
*\*\         - RCC_AHB_PERIPH_GPIOD   
*\*\         - RCC_AHB_PERIPH_ADC     
*\*\return  none
**/
void RCC_AHB_Peripheral_Clock_Enable(uint32_t AHB_periph)
{
    RCC->AHBPCLKEN |= AHB_periph;
}

/**
*\*\name    RCC_AHB_Peripheral_Clock_Disable.
*\*\fun     Disables the AHB peripheral clock.
*\*\param   AHB_periph (AHB peripheral to gates its clock):
*\*\         - RCC_AHB_PERIPH_DMA    
*\*\         - RCC_AHB_PERIPH_SRAM   
*\*\         - RCC_AHB_PERIPH_FLITF  
*\*\         - RCC_AHB_PERIPH_CRC    
*\*\         - RCC_AHB_PERIPH_GPIOA   
*\*\         - RCC_AHB_PERIPH_GPIOB 
*\*\         - RCC_AHB_PERIPH_GPIOD   
*\*\         - RCC_AHB_PERIPH_ADC     
*\*\return  none
*\*\note    SRAM and FLITF clock can be disabled only during sleep mode.
**/
void RCC_AHB_Peripheral_Clock_Disable(uint32_t AHB_periph)
{
    RCC->AHBPCLKEN &= ~AHB_periph;
}

/**
*\*\name    RCC_APB2_Peripheral_Clock_Enable.
*\*\fun     Enables the High Speed APB (APB2) peripheral clock.
*\*\param   APB2_periph (APB2 peripheral to gates its clock):
*\*\        - RCC_APB2_PERIPH_AFIO   
*\*\        - RCC_APB2_PERIPH_BEEPER 
*\*\        - RCC_APB2_PERIPH_TIM1   
*\*\        - RCC_APB2_PERIPH_SPI1   
*\*\        - RCC_APB2_PERIPH_TIM8   
*\*\        - RCC_APB2_PERIPH_UART1 
*\*\        - RCC_APB2_PERIPH_UART4  
*\*\        - RCC_APB2_PERIPH_SPI2   
*\*\return none. 
**/
void RCC_APB2_Peripheral_Clock_Enable(uint32_t APB2_periph)
{
    RCC->APB2PCLKEN |= APB2_periph;
}

/**
*\*\name    RCC_APB2_Peripheral_Clock_Disable.
*\*\fun     Disables the High Speed APB (APB2) peripheral clock.
*\*\param   APB2_periph (APB2 peripheral to gates its clock)：
*\*\        - RCC_APB2_PERIPH_AFIO   
*\*\        - RCC_APB2_PERIPH_BEEPER 
*\*\        - RCC_APB2_PERIPH_TIM1   
*\*\        - RCC_APB2_PERIPH_SPI1   
*\*\        - RCC_APB2_PERIPH_TIM8   
*\*\        - RCC_APB2_PERIPH_UART1 
*\*\        - RCC_APB2_PERIPH_UART4  
*\*\        - RCC_APB2_PERIPH_SPI2   
*\*\return none. 
**/
void RCC_APB2_Peripheral_Clock_Disable(uint32_t APB2_periph)
{
    RCC->APB2PCLKEN &= ~APB2_periph;
}

/**
*\*\name    RCC_APB1_Peripheral_Clock_Enable.
*\*\fun     Enables the High Speed APB (APB1) peripheral clock.
*\*\param   APB1_periph (APB1 peripheral to gates its clock):
*\*\        - RCC_APB1_PERIPH_TIM2       
*\*\        - RCC_APB1_PERIPH_TIM3       
*\*\        - RCC_APB1_PERIPH_TIM4       
*\*\        - RCC_APB1_PERIPH_TIM5       
*\*\        - RCC_APB1_PERIPH_TIM6       
*\*\        - RCC_APB1_PERIPH_WWDG       
*\*\        - RCC_APB1_PERIPH_USART2     
*\*\        - RCC_APB1_PERIPH_I2C1       
*\*\        - RCC_APB1_PERIPH_I2C2        
*\*\        - RCC_APB1_PERIPH_PWR        
*\*\return none. 
**/
void RCC_APB1_Peripheral_Clock_Enable(uint32_t APB1_periph)
{
    RCC->APB1PCLKEN |= APB1_periph;
}

/**
*\*\name    RCC_APB1_Peripheral_Clock_Disable.
*\*\fun     Disables the High Speed APB (APB1) peripheral clock.
*\*\param   APB1_periph (APB1 peripheral to gates its clock)：
*\*\        - RCC_APB1_PERIPH_TIM2       
*\*\        - RCC_APB1_PERIPH_TIM3       
*\*\        - RCC_APB1_PERIPH_TIM4       
*\*\        - RCC_APB1_PERIPH_TIM5       
*\*\        - RCC_APB1_PERIPH_TIM6       
*\*\        - RCC_APB1_PERIPH_WWDG       
*\*\        - RCC_APB1_PERIPH_USART2     
*\*\        - RCC_APB1_PERIPH_I2C1       
*\*\        - RCC_APB1_PERIPH_I2C2      
*\*\        - RCC_APB1_PERIPH_PWR  
*\*\return none. 
**/
void RCC_APB1_Peripheral_Clock_Disable(uint32_t APB1_periph)
{
    RCC->APB1PCLKEN &= ~APB1_periph;
}

/**
*\*\name    RCC_AHB_Peripheral_Reset.
*\*\fun     AHB peripheral reset.
*\*\param   AHB_periph specifies the AHB peripheral to reset.    
*\*\         - RCC_AHB_PERIPH_GPIOA   
*\*\         - RCC_AHB_PERIPH_GPIOB  
*\*\         - RCC_AHB_PERIPH_GPIOD   
*\*\         - RCC_AHB_PERIPH_ADC  
*\*\return none.
**/
void RCC_AHB_Peripheral_Reset(uint32_t AHB_periph)
{
    RCC->AHBPRST |= AHB_periph;
    RCC->AHBPRST &= ~AHB_periph;
}

/**
*\*\name    RCC_APB2_Peripheral_Reset.
*\*\fun     High Speed APB (APB2) peripheral reset.
*\*\param   APB2_periph specifies the APB2 peripheral to reset.
*\*\        - RCC_APB2_PERIPH_AFIO   
*\*\        - RCC_APB2_PERIPH_BEEPER 
*\*\        - RCC_APB2_PERIPH_TIM1   
*\*\        - RCC_APB2_PERIPH_SPI1   
*\*\        - RCC_APB2_PERIPH_TIM8   
*\*\        - RCC_APB2_PERIPH_UART1 
*\*\        - RCC_APB2_PERIPH_UART4  
*\*\        - RCC_APB2_PERIPH_SPI2 
*\*\return none.
**/
void RCC_APB2_Peripheral_Reset(uint32_t APB2_periph)
{
    RCC->APB2PRST |= APB2_periph;
    RCC->APB2PRST &= ~APB2_periph;
}

/**
*\*\name    RCC_APB1_Peripheral_Reset.
*\*\fun     Low Speed APB (APB1) peripheral reset.
*\*\param   APB1_periph specifies the APB1 peripheral to reset.
*\*\        - RCC_APB1_PERIPH_TIM2       
*\*\        - RCC_APB1_PERIPH_TIM3       
*\*\        - RCC_APB1_PERIPH_TIM4       
*\*\        - RCC_APB1_PERIPH_TIM5       
*\*\        - RCC_APB1_PERIPH_TIM6                 
*\*\        - RCC_APB1_PERIPH_WWDG       
*\*\        - RCC_APB1_PERIPH_USART2     
*\*\        - RCC_APB1_PERIPH_I2C1       
*\*\        - RCC_APB1_PERIPH_I2C2       
*\*\        - RCC_APB1_PERIPH_PWR  
*\*\return none. 
**/
void RCC_APB1_Peripheral_Reset(uint32_t APB1_periph)
{
    RCC->APB1PRST |= APB1_periph;
    RCC->APB1PRST &= ~APB1_periph;
}

/**
*\*\name    RCC_Backup_Reset.
*\*\fun     Backup domain reset.
*\*\param   none  
*\*\return  none. 
**/
void RCC_Backup_Reset(void)
{
    *(__IO uint32_t*)RCC_BDSFTRST_BITBAND = (uint32_t)ENABLE;
    *(__IO uint32_t*)RCC_BDSFTRST_BITBAND = (uint32_t)DISABLE;
}

/**
*\*\name   RCC_MCO_PLL_Prescaler_Config.
*\*\fun    Configures the MCO PLL clock prescaler.
*\*\param  MCO_PLL_prescaler(MCO PLL clock prescaler): 
*\*\        - RCC_MCO_PLLCLK_DIV2 
*\*\        - RCC_MCO_PLLCLK_DIV3 
*\*\        - RCC_MCO_PLLCLK_DIV4 
*\*\        - RCC_MCO_PLLCLK_DIV5 
*\*\        - RCC_MCO_PLLCLK_DIV6 
*\*\        - RCC_MCO_PLLCLK_DIV7 
*\*\        - RCC_MCO_PLLCLK_DIV8 
*\*\        - RCC_MCO_PLLCLK_DIV9 
*\*\        - RCC_MCO_PLLCLK_DIV10
*\*\        - RCC_MCO_PLLCLK_DIV11
*\*\        - RCC_MCO_PLLCLK_DIV12
*\*\        - RCC_MCO_PLLCLK_DIV13
*\*\        - RCC_MCO_PLLCLK_DIV14
*\*\        - RCC_MCO_PLLCLK_DIV15 
*\*\return  none. 
**/
void RCC_MCO_PLL_Prescaler_Config(uint32_t MCO_PLL_prescaler)
{
    uint32_t temp_value = 0;

    temp_value = RCC->CFG;
    /* Clear MCOPRE[3:0] bits */
    temp_value &= RCC_MCO_PLLCLK_DIV_MASK;
    /* Set MCOPRE[3:0] bits according to MCO_PLL_prescaler value */
    temp_value |= MCO_PLL_prescaler;

