axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/src/n32g401f8s7_1_rcc.c
    /* Store the new value */
    RCC->CFG = temp_value;
}

/**
*\*\name   RCC_MCO_Source_Config.
*\*\fun    Selects the clock source to output on MCO pin.
*\*\param  MCO_source(clock source to output): 
*\*\     - RCC_MCO_NOCLK      
*\*\     - RCC_MCO_SYSCLK     
*\*\     - RCC_MCO_HSI        
*\*\     - RCC_MCO_HSE       
*\*\     - RCC_MCO_PLLCLK     
*\*\     - RCC_MCO_LSI       
*\*\return  none. 
**/
void RCC_MCO_Source_Config(uint32_t MCO_source)
{
    uint32_t temp_value = 0;

    temp_value = RCC->CFG;
    /* Clear MCO[3:0] bits */
    temp_value &= RCC_MCO_MASK;
    /* Set MCO[3:0] bits according to MCO_source value */
    temp_value |= MCO_source;

    /* Store the new value */
    RCC->CFG = temp_value;
}

/**
*\*\name    RCC_Flag_Status_Get.
*\*\fun     Checks whether the specified RCC flag is set or not.
*\*\param   RCC_flag:
*\*\	      - RCC_FLAG_HSIRD      HSI oscillator clock ready
*\*\          - RCC_FLAG_HSERD      HSE oscillator clock ready
*\*\	      - RCC_FLAG_PLLRD      PLL clock ready
*\*\	      - RCC_FLAG_LSIRD      LSI oscillator clock ready
*\*\	      - RCC_FLAG_BKPEMC     BackUp EMC reset flag
*\*\	      - RCC_FLAG_MMURST     Mmu reset flag
*\*\	      - RCC_FLAG_PINRST     Pin reset
*\*\	      - RCC_FLAG_PORRST     POR/PDR reset
*\*\	      - RCC_FLAG_SFTRST     Software reset
*\*\	      - RCC_FLAG_IWDGRST    Independent Watchdog reset
*\*\	      - RCC_FLAG_WWDGRST    Window Watchdog reset
*\*\	      - RCC_FLAG_LPWRRST    Low Power reset
*\*\return  FlagStatus:
*\*\      	  - SET 
*\*\  	      - RESET
**/
FlagStatus RCC_Flag_Status_Get(uint8_t RCC_flag)
{
    uint32_t temp_value = 0;
    uint32_t reg_value  = 0;

    /* Get the RCC register index */
    temp_value = RCC_flag >> RCC_FLAG_OFFSET;
    switch(temp_value)
    {
        case 1: /* The flag to check is in CTRL register */
            reg_value = RCC->CTRL;
            break;
        case 2: /* The flag to check is in BDCTRL register */
           reg_value = RCC->BDCTRL;
           break;
        default:/* The flag to check is in CTRLSTS register */
            reg_value = RCC->CTRLSTS;
            break;
    }

    /* Get the flag position */
    temp_value = RCC_flag & RCC_FLAG_MASK;
    if ((reg_value & ((uint32_t)1 << temp_value)) != (uint32_t)RESET)
    {
        return SET;
    }
    else
    {
        return RESET;
    }
}

/**
*\*\name    RCC_Reset_Flag_Clear.
*\*\fun     Clears the RCC reset flags.
*\*\param   none
*\*\return  none
**/
void RCC_Reset_Flag_Clear(void)
{
    /* Set RMRSTF bit to clear the reset flags */
    RCC->CTRLSTS |= RCC_REMOVE_RESET_FLAG;
    /* RMRSTF bit should be reset */
    RCC->CTRLSTS &= ~RCC_REMOVE_RESET_FLAG;
}

/**
*\*\name    RCC_Interrupt_Status_Get.
*\*\fun     Checks whether the specified RCC interrupt has occurred or not.
*\*\param   interrupt_flag(RCC interrupt source to check):
*\*\         - RCC_INT_LSIRDIF    LSI ready interrupt
*\*\         - RCC_INT_HSIRDIF    HSI ready interrupt
*\*\         - RCC_INT_HSERDIF    HSE ready interrupt
*\*\         - RCC_INT_PLLRDIF    PLL ready interrupt
*\*\         - RCC_INT_CLKSSIF    Clock Security System interrupt in HSE
*\*\return  The new state of RccInt 
*\*\         - SET
*\*\         - RESET
**/
INTStatus RCC_Interrupt_Status_Get(uint32_t interrupt_flag)
{

    /* Check the status of the specified RCC interrupt */
    if ((RCC->CLKINT & interrupt_flag) != (uint32_t)RESET)
    {
        return SET;
    }
    else
    {
        return RESET;
    }
}

/**
*\*\name    RCC_Interrupt_Status_Clear.
*\*\fun     Clears the RCC's interrupt pending bits.
*\*\param   interrupt_clear(interrupt pending bit to clear):
*\*\         - RCC_INT_LSIRDICLR    LSI ready interrupt
*\*\         - RCC_INT_HSIRDICLR    HSI ready interrupt
*\*\         - RCC_INT_HSERDICLR    HSE ready interrupt
*\*\         - RCC_INT_PLLRDICLR    PLL ready interrupt
*\*\         - RCC_INT_CLKSSICLR    Clock Security System interrupt in HSE
*\*\return  none
**/
void RCC_Interrupt_Status_Clear(uint32_t interrupt_clear)
{
    /* Software set this bit to clear INT flag. */
    RCC->CLKINT |= interrupt_clear;
}


